package ru.kdv.parserBigData.model.xlsx;

public class RowModel {

    /*
    ID Коллекторского агентства	Число	13
            2	ТБ (сокращенное наименование)	Строка	ББ
3	Идентификационный номер (ID) клиента	Строка	C100071025
4	Идентификационный номер (ID) кредитного договора	Строка	A132139825
5	№ кредитного договора	Строка	1282-P-10738426600
            6	Дата выдачи кредитного договора	Дата	20.06.2019
            7	Дата окончания кредитного договора	Дата	06.06.2020
            8	Вид кредита	Строка	Кредитная карта
9	Сумма кредита (в валюте кредита)	Число	200088,98
            10	Признак участника	Строка	Заемщик
11	Ф.И.О. (полностью)/ ФИО должника (индивидуального предпринимателя)	Строка	Иванов Иван Иванович
12	Дата рождения (для ФЛ) 	Дата	28.07.1972
            13	Адрес регистрации/ адрес регистрации ИП	Строка	РОССИЯ, 665075, ИРКУТСКАЯ ОБЛАСТЬ, ТАЙШЕТСКИЙ Р-Н р-он, рп.ЮРТЫ, ул.СИБИРСКАЯ, д.5
            14	Фактический адрес проживания/нахождения	Строка	РОССИЯ, 665075, ИРКУТСКАЯ ОБЛАСТЬ, ТАЙШЕТСКИЙ Р-Н р-он, рп.ЮРТЫ, ул.СИБИРСКАЯ, д.5
            15	Номер телефона по адресу регистрации	Строка	+79247101222, +79500996322
            16	Номер телефона по адресу фактического проживания/нахождения	Строка	+79500996322
            17	Мобильный номер телефона	Строка	+79500996322
            18	Прочие номера телефонов	Строка	+79500996322
            19	Стадия взыскания (досудебная / исполнительное производство / внебалансовая задолженность)	Строка	Досудебная
20	Дата включения задолженности в "Реестр должников" на передачу	Дата	09.06.2020
            21	Дата окончания/прекращения работы Агента с договором	Дата	09.07.2020
            22	Дата начала учета погашений	Дата	15.06.2020
            23	Дата окончания учета погашений	Дата	15.06.2024
            24	Сумма срочной задолженности (в рублях)	Число	20 624,81
            25	Сумма просроченной задолженности (в рублях)	Число	4 368,05
            26	Сумма срочных процентов (в рублях)	Число	0,00
            27	Сумма просроченных процентов (в рублях)	Число	133,12
            28	Сумма штрафов (в т.ч. комиссий и неустоек) (в рублях)	Число	14,19
            29	Государственная пошлина (в рублях)	Число	0,00
            30	Сумма просроченной задолженности для сбора ДО/КА (в рублях)	Число	597,31
            31	Дата образования просрочки	Дата	28.01.2020
            32	Кол-во дней просрочки на дату включения задолженности в "Реестр должников" на передачу	Число	122
            33	Дата последнего платежа	Дата	01.04.2020
            34	Сумма последнего платежа	Число	35
            35
    Ставка вознаграждения
    Число	4%
            36	ИНН должника	Число	123456789012*/
}
